WA2302/STM32F0_Workspace/MinOS/minos.h
/**
  ******************************************************************************
  * @file    minos.h 
  * @author  Windy Albert
  * @version V2.1
  * @date    04-November-2023
  * @brief   This is the head file for MinOS, a NO GRAB OS for embedded system.
  *          OSTaskCreate( task, stk ) @USAGE OSTaskCreate( Task00, 0x80 );
  *          void OSStart( void );     @USAGE OSStart( );
  *          void OSTimeDly( ticks );  @USAGE OSTimeDly( 1000 );
  *          OSWait( con )             @USAGE OSWait( var >= 1 );
  *          OSWaitTime( con,time );   @USAGE OSWaitTime( var >= 1,1000 );
  *          OSisTimeOut()             @USAGE if( OSisTimeOut() ){ //do sth }  
  ******************************************************************************
  */

#ifndef _MINOS_H
#define _MINOS_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"
#include "minos_conf.h"

typedef struct os_tcb {
    uint32_t *OSTCBStkPtr;           /* Pointer to current top of stack       */
    struct os_tcb *OSTCBNext;        /* Pointer to next TCB in the TCB list   */
    uint32_t OSTCBWakeTime;          /* Next time to run this task            */
} OS_TCB;

extern void TaskCreate (void (*task)(void), uint32_t *ptos);
extern void __Sched (void);

extern uint32_t         SysTime;
extern OS_TCB          *OSTCBCur;
#define OSTime_Now()    SysTime

/******************************************************************************/
/* Public functions ----------------------------------------------------------*/
/******************************************************************************/
#define OSTaskCreate( task, stk )                   \
    {   extern void task(void );                    \
        static uint32_t task##_Stk[stk];            \
        TaskCreate( task , &task##_Stk[stk-1]); }

extern void OSStart( void );
extern void OSTimeDly( uint16_t ticks );

#define OSWait( con )  while(!(con)){__Sched();}

#define OSWaitTime( con,time )                                      \
                { OSTCBCur->OSTCBWakeTime = OSTime_Now() + time;    \
                  while(!(con) ){                                   \
                    if( OSTime_Now()<OSTCBCur->OSTCBWakeTime ){     \
                        __Sched();                                  \
                    }else{                                          \
                        OSTCBCur->OSTCBWakeTime = 0;break;          \
                    }                                               \
                  }                                                 \
                }
#define OSisTimeOut() (OSTCBCur->OSTCBWakeTime==0)

#endif /* _MINOS_H */

/************* (C) COPYRIGHT 2023 Windy Albert *********** END OF FILE ********/
